app/views/surveys/show.html.erb

<h1> <%= @survey.title %> </h1>
<% @survey.questions.each do |t| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = 4