app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
    @user = User.first
---
SELECT "surveys".* FROM "surveys"
SELECT "users".* FROM "users" LIMIT 1

  def show
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @user = User.first
---
SELECT "users".* FROM "users" LIMIT 1

  def create
    @user = User.first
    @survey = Survey.new(params[:survey])
    if @survey.save
---
SELECT "users".* FROM "users" LIMIT 1
INSERT INTO "surveys" ("created_at", "creator_id", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 24 Jul 2013 21:53:23 UTC +00:00], ["creator_id", nil], ["title", "blahblabh"], ["updated_at", Wed, 24 Jul 2013 21:53:23 UTC +00:00]]